test/data/convert/cdar-PPF/payment-212-encaissee.json

{
	"$schema": "https://gobl.org/draft-0/envelope",
	"head": {
		"uuid": "0195ce71-dc9c-72c8-bf2c-9890a4a9f0a2",
		"dig": {
			"alg": "sha256",
			"val": "d318e6b5564f1c8a500a09624ff84f599c76388b82a98bae49b5b8d4fc44bead"
		}
	},
	"doc": {
		"$schema": "https://gobl.org/draft-0/bill/payment",
		"$addons": [
			"fr-ctc-flow6-v1"
		],
		"uuid": "0195ce71-dc9c-72c8-bf2c-9890a4a9f0a2",
		"type": "receipt",
		"code": "PAY-212",
		"issue_date": "2025-07-02",
		"currency": "EUR",
		"ext": {
			"fr-ctc-flow6-condition": "MEN",
			"fr-ctc-flow6-status": "212"
		},
		"supplier": {
			"name": "VENDEUR",
			"identities": [
				{
					"code": "100000009",
					"ext": {
						"iso-scheme-id": "0002"
					}
				}
			],
			"inboxes": [
				{
					"key": "peppol",
					"scheme": "0225",
					"code": "100000009_PEP"
				}
			],
			"ext": {
				"fr-ctc-flow6-role": "SE"
			}
		},
		"customer": {
			"name": "ACHETEUR",
			"identities": [
				{
					"code": "200000008",
					"ext": {
						"iso-scheme-id": "0002"
					}
				}
			],
			"inboxes": [
				{
					"key": "peppol",
					"scheme": "0225",
					"code": "200000008_PEP"
				}
			],
			"ext": {
				"fr-ctc-flow6-role": "BY"
			}
		},
		"lines": [
			{
				"i": 1,
				"document": {
					"type": "380",
					"issue_date": "2025-07-01",
					"code": "F202500003"
				},
				"amount": "500.00",
				"due": "250.00"
			}
		],
		"methods": [
			{
				"key": "credit-transfer",
				"amount": "500.00"
			}
		],
		"total": "500.00"
	}
}